note/computer science/emacs/basic/A-Introduction-to-Programming-in-Emacs-Lisp-HOWTO.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-12 Wed 13:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Learning Emacs Lisp</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Learning Emacs Lisp</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf0b910a">1. A Introduction to Programming in Emacs Lisp - eintr</a>
<ul>
<li><a href="#orgf0dc497">1.1. 序言</a>
<ul>
<li><a href="#org791dc1c">1.1.1. History of Lisp</a></li>
<li><a href="#orge9b2735">1.1.2. 使用Emacs</a></li>
</ul>
</li>
<li><a href="#orge06e793">1.2. List Processing</a>
<ul>
<li><a href="#org4bb5928">1.2.1. Lisp Lists</a>
<ul>
<li><a href="#org7f42268">1.2.1.1. Lisp Atoms</a></li>
<li><a href="#orgf990018">1.2.1.2. 列表中的空格</a></li>
<li><a href="#orgaa41193">1.2.1.3. GNU Emacs 帮助你输入列表</a></li>
</ul>
</li>
<li><a href="#orgd23a633">1.2.2. 运行一个程序</a></li>
<li><a href="#org6d4e548">1.2.3. 产生错误信息</a></li>
<li><a href="#org6dfb0ba">1.2.4. Symbol名称和函数定义</a></li>
<li><a href="#org2280a8d">1.2.5. Lisp编译器</a></li>
<li><a href="#orgc093ab7">1.2.6. 执行(evaluation)</a></li>
<li><a href="#orgdfaadf6">1.2.7. 变量</a></li>
<li><a href="#orgc979d07">1.2.8. 参数</a></li>
<li><a href="#org18328b6">1.2.9. 变量赋值</a></li>
<li><a href="#org106f996">1.2.10. 总结</a></li>
<li><a href="#org5b6516f">1.2.11. 练习</a></li>
</ul>
</li>
<li><a href="#org432ae50">1.3. 练习执行命令</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf0b910a" class="outline-2">
<h2 id="orgf0b910a"><span class="section-number-2">1</span> A Introduction to Programming in Emacs Lisp - eintr</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf0dc497" class="outline-3">
<h3 id="orgf0dc497"><span class="section-number-3">1.1</span> 序言</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li><a id="org2a214f3"></a> <i>The GNU Emacs Lisp Reference Manual</i></li>
</ol>
</div>
<div id="outline-container-org791dc1c" class="outline-4">
<h4 id="org791dc1c"><span class="section-number-4">1.1.1</span> History of Lisp</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Lisp MIT late 1950s 为研究AI开发</li>
<li>Maclisp MIT 1960s</li>
<li>GNU Emacs Lisp 受 Maclisp 启发</li>
<li>Common Lisp 1980s 成为标准</li>
<li>GNU Emacs Lisp 比 Common Lisp更简单</li>
<li>Emacs发行版中有可选扩展 <b>cl.el</b> 以支持Common Lisp特性</li>
<li><a href="https://en.wikipedia.org/wiki/Lisp_(programming_language)">More at Wikipedia</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge9b2735" class="outline-4">
<h4 id="orge9b2735"><span class="section-number-4">1.1.2</span> 使用Emacs</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>新手建议 读内置教程</li>
<li><b>C-u</b> <i>universal argument</i> 不设置数字默认为4
<ul class="org-ul">
<li>更多参考 <i>Numric Arguments</i> 章节 <a href="#org2a214f3">1</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge06e793" class="outline-3">
<h3 id="orge06e793"><span class="section-number-3">1.2</span> List Processing</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Lisp Stands for LISt Processing</li>
<li>操作 <i>列表</i> 的编程语言</li>
<li>小括号 标记 列表的边界</li>
<li>单引号 有事可以产生一个列表 apostrophe <i>single-quote</i></li>
<li>list 是 Lisp 的基础</li>
</ul>
</div>
<div id="outline-container-org4bb5928" class="outline-4">
<h4 id="org4bb5928"><span class="section-number-4">1.2.1</span> Lisp Lists</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>空格 换行等 不影响列表内容</li>
<li>数据和程序都以同样的方式呈现
<ul class="org-ul">
<li>即单词(字符)、数字或其他列表组成的列表</li>
<li>以空格分割 被括号包围</li>
<li>由于程序跟数据以同样的方式呈现 所以程序可以简单的作为数据提供给另外一个程序</li>
<li>括号内包含其他标点符号的语句 不能算做列表
<ul class="org-ul">
<li>除非用引号包括</li>
</ul></li>
</ul></li>
</ul>
</div>
<div id="outline-container-org7f42268" class="outline-5">
<h5 id="org7f42268"><span class="section-number-5">1.2.1.1</span> Lisp Atoms</h5>
<div class="outline-text-5" id="text-1-2-1-1">
<ul class="org-ul">
<li>原子 取不可分割/切割的意思</li>
<li>列表中使用的单词(Words)被分割后就与原来的意义不同</li>
<li>列表可以被分割</li>
<li>原子 以空格分离 可以紧邻括号</li>
<li>定义上
<ul class="org-ul">
<li>列表由
<ul class="org-ul">
<li>括号
<ul class="org-ul">
<li>包括住的 <b>以空格分离</b> 的原子</li>
<li>或 包括的其他列表</li>
<li>或 包括的原子和列表的</li>
</ul></li>
</ul></li>
</ul></li>
<li>列表可以只包含一个原子或不含任何东西
<ul class="org-ul">
<li>() 不包含任何东西的列表</li>
<li>成为 空列表(<i>empty list</i>)</li>
<li>一个空列表被认为即是一个原子也是一个列表</li>
</ul></li>
<li>S-表达式(<i>symbolic expressions s-expressions</i>)
<ul class="org-ul">
<li>被 <i>打印</i> 出来的 原子和列表(<i>the printed representation</i>) 被称为 S表达式</li>
<li>表达式(expression) 本身可以指代
<ul class="org-ul">
<li>被打印出来的内容的本身</li>
<li>或者 原子和列表
<ul class="org-ul">
<li>电脑内部保存的原子和列表</li>
<li><i>The word expression by itself can refer to either the printed representation, or to the atom or list as it is held internally in the computer.</i></li>
<li>通常 表达式这个定义 使用上很模糊</li>
<li>在许多文本中 form 这个词被用作表达式的近义词</li>
</ul></li>
</ul></li>
</ul></li>
<li>考虑到对列表进行操作 列表中的原子是不可分割的(<b>unsplittable</b>)</li>
<li>组成Lisp 原子的的字母的意义与英语中的字符意义是不同的</li>
<li>Lisp 中原子的种类
<ul class="org-ul">
<li>数字</li>
<li>符号(<i>symbols</i>)</li>
</ul></li>
<li>原子这个词不经常使用
<ul class="org-ul">
<li>因为会指定特定种类的原子进行操作</li>
</ul></li>
<li>Lisp编程大多与列表中的 符号(symbols) 相关 有时是处理数字</li>
<li>双引号(doble quotation marks) 包括的文本 被认为是一个原子
<ul class="org-ul">
<li>标点符号和空格等一起作为一个原子</li>
<li>这种类型的原子成为 字符串(<i>string</i>)</li>
<li>由电脑打印出来的人类可读的内容</li>
<li>字符串作为与数字或符号不同的原子类型 使用方法也不同</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf990018" class="outline-5">
<h5 id="orgf990018"><span class="section-number-5">1.2.1.2</span> 列表中的空格</h5>
<div class="outline-text-5" id="text-1-2-1-2">
<ul class="org-ul">
<li>列表中空格的数量无关紧要</li>
<li>多余的空格和断行 可以使阅读代码更加易读</li>
</ul>
</div>
</div>
<div id="outline-container-orgaa41193" class="outline-5">
<h5 id="orgaa41193"><span class="section-number-5">1.2.1.3</span> GNU Emacs 帮助你输入列表</h5>
<div class="outline-text-5" id="text-1-2-1-3">
<ul class="org-ul">
<li>&lt;TAB&gt; 按键 自动缩进</li>
<li>&lt;M-C-\&gt; 空白符号</li>
<li>括号匹配</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd23a633" class="outline-4">
<h4 id="orgd23a633"><span class="section-number-4">1.2.2</span> 运行一个程序</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>任何 列表 在Lisp中都是可运行的程序</li>
<li>运行(<i>evaluate</i>) 程序 电脑会做
<ol class="org-ol">
<li>除了返回列表本身之外不做任何事情</li>
<li>将列表的第一个 符号 当作命令来做对应的事情</li>
<li>发送错误信息</li>
</ol></li>
<li>放在列表前面的 单引号 被称作 引用(<i>quote</i>)
<ul class="org-ul">
<li>当产生一个列表时 它告诉Lisp只产生一个列表 而不做其他事情</li>
<li>如果没有单引号 第一个 符号 会被当作命令来执行
<ul class="org-ul">
<li>这些命令在Lisp中被称作 函数(<i>functions</i>)</li>
</ul></li>
</ul></li>
<li>将光标置于右手边的括号后面 然后输入 &lt;C-x C-e&gt; 结果将会呈现在 回应区(<i>echo area</i>)</li>
<li>Lisp <i>interpreter</i> Lisp编译器
<ul class="org-ul">
<li>词来自于 想出表达式需要做的工作的的人 ???</li>
<li>The name of the Lisp interpreter comes from the word for the task done by a human who comes up with the meaning of an expression—who interprets it.</li>
</ul></li>
<li>也可以运行 不是 作为列表一部分的原子
<ul class="org-ul">
<li>没有被包围在括号里的原子</li>
</ul></li>
<li>Lisp编译器将人类可读的表达式转换成计算机语言</li>
</ul>
</div>
</div>
<div id="outline-container-org6d4e548" class="outline-4">
<h4 id="org6d4e548"><span class="section-number-4">1.2.3</span> 产生错误信息</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>产生错误信息是无害的</li>
<li>经常会有意去产生错误信息</li>
<li>当你熟悉这门奇怪的语言的时候，错误信息可以提供信息
<ul class="org-ul">
<li>相对于被称作错误信息，更应该被称作 帮助信息</li>
</ul></li>
<li>错误信息是GNU Emacs内置的调试工具(<i>debugger</i>) 产生的 按 <i>q</i> 退出</li>
<li>&lt;C-x C-e&gt; 相当于命令 <i>eval-last-sxep</i></li>
<li><b><b>Backtrace</b></b> enables you to track Emacs backwards
<ul class="org-ul">
<li>追踪</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6dfb0ba" class="outline-4">
<h4 id="org6dfb0ba"><span class="section-number-4">1.2.4</span> Symbol名称和函数定义</h4>
<div class="outline-text-4" id="text-1-2-4">
<ul class="org-ul">
<li>Symbol 符号
<ul class="org-ul">
<li>Lisp的一个重要的特点</li>
<li>比如 +
<ul class="org-ul">
<li>其本身并不是计算机执行的一连串命令</li>
<li>而是用来定位定义或命令集的方法</li>
<li>既可以是永久的 也可以是暂时的</li>
</ul></li>
</ul></li>
<li>命令集可以使用多个名称来指向</li>
<li>而一个Symbol一次只可以代表一个函数</li>
<li>可以随时更换指向</li>
</ul>
</div>
</div>
<div id="outline-container-org2280a8d" class="outline-4">
<h4 id="org2280a8d"><span class="section-number-4">1.2.5</span> Lisp编译器</h4>
<div class="outline-text-4" id="text-1-2-5">
<ul class="org-ul">
<li>执行命令时编译器的动作
<ul class="org-ul">
<li>查看列表前面是否有单引号
<ul class="org-ul">
<li>如果有则返回列表</li>
</ul></li>
<li>如果没有 则查看第一个元素是否是函数
<ul class="org-ul">
<li>如果是 则按照指示运行</li>
</ul></li>
<li>如果不是则返回错误信息</li>
</ul></li>
<li>补充1
<ul class="org-ul">
<li>编译器可以执行没有被引用或没有括号的符号</li>
<li>编译器会尝试判断符号的值是否是一个变量</li>
</ul></li>
<li>补充2
<ul class="org-ul">
<li>一些特殊的或在特殊情况下使用的函数
<ul class="org-ul">
<li><i>special forms</i></li>
</ul></li>
<li>特殊的用途
<ul class="org-ul">
<li>比如定义一个函数</li>
</ul></li>
</ul></li>
<li>补充3
<ul class="org-ul">
<li>宏 <i>macros</i>
<ul class="org-ul">
<li>宏是Lisp中定义的与函数不同的结构 将一些表达式转换成另外的表达式进行执行</li>
</ul></li>
</ul></li>
<li>不需要区别特殊函数 宏 原函数
<ul class="org-ul">
<li>if是一个特殊函数</li>
<li>when是宏</li>
<li>defun在早期版本中是特殊函数 但是现在是宏
<ul class="org-ul">
<li>功能还是保持相同的</li>
</ul></li>
</ul></li>
<li>补充4
<ul class="org-ul">
<li>当编译器判断需要执行的不是特殊函数时</li>
<li>而且执行的部分是在列表中的</li>
<li>它会先判断列表中是否含有子列表</li>
<li>然后编译器会先判断怎么执行子列表 然后再执行上一层的列表</li>
<li>编译器总是会优先执行最内部的列表 获得结果后提供给上一层的列表</li>
<li>如果没有子列表 编译器会按照从左到右的顺序执行 从一个表达式到另外一个</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc093ab7" class="outline-4">
<h4 id="orgc093ab7"><span class="section-number-4">1.2.6</span> 执行(evaluation)</h4>
</div>
<div id="outline-container-orgdfaadf6" class="outline-4">
<h4 id="orgdfaadf6"><span class="section-number-4">1.2.7</span> 变量</h4>
</div>
<div id="outline-container-orgc979d07" class="outline-4">
<h4 id="orgc979d07"><span class="section-number-4">1.2.8</span> 参数</h4>
</div>
<div id="outline-container-org18328b6" class="outline-4">
<h4 id="org18328b6"><span class="section-number-4">1.2.9</span> 变量赋值</h4>
</div>
<div id="outline-container-org106f996" class="outline-4">
<h4 id="org106f996"><span class="section-number-4">1.2.10</span> 总结</h4>
</div>
<div id="outline-container-org5b6516f" class="outline-4">
<h4 id="org5b6516f"><span class="section-number-4">1.2.11</span> 练习</h4>
</div>
</div>
<div id="outline-container-org432ae50" class="outline-3">
<h3 id="org432ae50"><span class="section-number-3">1.3</span> 练习执行命令</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-05-12 Wed 13:40</p>
<p class="validation"></p>
</div>
</body>
</html>
